tests/load/homeSlateLineup/dev.yml
config:
  target: "https://recommendation-api.getpocket.dev"

  phases:
    - duration: 1800
      arrivalRate: 2
      rampTo: 15
      name: "Warm up"

    - duration: 900
      arrivalRate: 15
      rampTo: 15
      name: "Sustain load"
  defaults:
    headers:
      Content-Type: application/json

scenarios:

  - name: "homeSlateLineup"
    flow:
      - post:
          url: "/"
          body: '{"query":"query HomeLoadTest { homeSlateLineup { slates { slateId: id recommendationReasonType headline subheadline moreLink { url text } recommendations { corpusItem { corpusItemId: id } reason { name type } } } } }"}'
          headers:
             Content-Type: application/json
             userId: 123456
             encodedId: ABCDEF
             consumerKey: 123-456-678
             apiId: 123
             applicationName: Postman
             guid: 789
          expect:
            - statusCode: 200
            - contentType: json